## Customers

In [1]:
import pandas as pd

df = pd.read_csv("../Database/customers.csv")
df.head(3)

,CUSTOMERNAME,PHONE,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,id
0,Land of Toys Inc.,2125557818,897 Long Airport Avenue,Bilinmiyor,NYC,NY,10022,USA,Bilinmiyor,Yu,Kwai,1
1,Reims Collectables,26.47.1555,59 rue de l'Abbaye,Bilinmiyor,Reims,Bilinmiyor,51100,France,EMEA,Henriot,Paul,2
2,Lyon Souveniers,+33 1 46 62 7555,27 rue du Colonel Pierre Avia,Bilinmiyor,Paris,Bilinmiyor,75508,France,EMEA,Da Cunha,Daniel,3

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   CUSTOMERNAME      92 non-null     object
 1   PHONE             92 non-null     object
 2   ADDRESSLINE1      92 non-null     object
 3   ADDRESSLINE2      92 non-null     object
 4   CITY              92 non-null     object
 5   STATE             92 non-null     object
 6   POSTALCODE        92 non-null     object
 7   COUNTRY           92 non-null     object
 8   TERRITORY         92 non-null     object
 9   CONTACTLASTNAME   92 non-null     object
 10  CONTACTFIRSTNAME  92 non-null     object
 11  id                92 non-null     int64
dtypes: int64(1), object(11)
memory usage: 8.8+ KB

In [6]:
can_be_checked_list = ['PHONE', 'CITY', 'STATE', 'POSTALCODE', 'COUNTRY', 'TERRITORY']

for col in can_be_checked_list:
    print('='*50)
    print(df[col].value_counts())

==================================================
PHONE
6175558555        2
2125557818        1
(198) 555-8888    1
91.24.4555        1
+63 2 555 3587    1
                 ..
2155554695        1
61-7-3844-6555    1
2125558493        1
+65 221 7555      1
6175558428        1
Name: count, Length: 91, dtype: int64
==================================================
CITY
NYC           5
Brickhaven    3
Madrid        3
Paris         3
Singapore     2
             ..
Nashua        1
Reims         1
Montreal      1
Osaka         1
Charleroi     1
Name: count, Length: 73, dtype: int64
==================================================
STATE
Bilinmiyor       46
CA               11
MA                9
NY                6
PA                3
CT                3
BC                2
NSW               2
Victoria          2
NJ                1
Queensland        1
Tokyo             1
NH                1
Quebec            1
Osaka             1
Isle of Wight     1
NV                1
Name: count, dtype: int64
==================================================
POSTALCODE
10022         5
58339         3
Bilinmiyor    3
94217         3
28023         2
             ..
2060          1
51100         1
530-0003      1
24067         1
B-6000        1
Name: count, Length: 74, dtype: int64
==================================================
COUNTRY
USA            35
France         12
Australia       5
UK              5
Spain           5
Italy           3
Norway          3
Finland         3
Germany         3
Canada          3
Belgium         2
Denmark         2
Singapore       2
Japan           2
Sweden          2
Austria         2
Philippines     1
Switzerland     1
Ireland         1
Name: count, dtype: int64
==================================================
TERRITORY
EMEA          44
Bilinmiyor    38
APAC           6
Japan          4
Name: count, dtype: int64

In [7]:
df['PHONE'].unique()

array(['2125557818', '26.47.1555', '+33 1 46 62 7555', '6265557265',
       '6505551386', '6505556809', '20.16.1555', '+47 2267 3215',
       '6505555787', '(1) 47.55.6555', '03 9520 4555', '2125551500',
       '2015559350', '2035552570', '40.67.8555', '6175558555',
       '90-224 8555', '07-98 9555', '2155551555', '6562-9555',
       '+61 2 9495 8555', '5085552555', '(171) 555-2282',
       '(91) 555 94 44', '0921-12 3555', '(91) 555 22 82', '+65 221 7555',
       '2125558493', '61-7-3844-6555', '2155554695', '78.32.5555',
       '(604) 555-3392', '3105553722', '6175555555', '2035559545',
       '+81 3 3584 0555', '011-4988555', '0695-34 6555', '30.59.8555',
       '4155551450', '6035558647', '02 9936 8555', '(514) 555-8054',
       '+81 06 6342 5555', '2155559857', '40.32.2555', '9145554562',
       '31 12 3555', '(171) 555-0297', '5085559555', '61.77.6555',
       '(171) 555-7555', '(93) 203 4555', '2155554369', '7605558146',
       '(02) 5554 67', '(604) 555-4555', '6175559555', '(198) 555-8888',
       '981-443655', '4085553659', '(1) 42.34.2555', '7675-3555',
       '6175552555', '+65 224 1555', '+63 2 555 3587', '91.24.4555',
       '0221-5554327', '0897-034555', '0522-556555', '6175557555',
       '+49 69 66 90 2555', '+358 9 8045 555', '2125557413',
       '+353 1862 1555', '+34 913 728 555', '(171) 555-1555',
       '86 21 3555', '2125551957', '3105552373', '(95) 555 82 82',
       '4155554312', '88.60.1555', '7025551838', '+47 2212 1555',
       '035-640555', '61-9-3844-6555', '2035554407', '+49 89 61 08 9555',
       '(071) 23 67 2555', '6175558428'], dtype=object)

In [9]:
df['PHONE'] = df['PHONE'].replace({r'[\+\-\(\)\.\s\/]': ''}, regex=True)
df['PHONE'].unique()

array(['2125557818', '26471555', '33146627555', '6265557265',
       '6505551386', '6505556809', '20161555', '4722673215', '6505555787',
       '147556555', '0395204555', '2125551500', '2015559350',
       '2035552570', '40678555', '6175558555', '902248555', '07989555',
       '2155551555', '65629555', '61294958555', '5085552555',
       '1715552282', '915559444', '0921123555', '915552282', '652217555',
       '2125558493', '61738446555', '2155554695', '78325555',
       '6045553392', '3105553722', '6175555555', '2035559545',
       '81335840555', '0114988555', '0695346555', '30598555',
       '4155551450', '6035558647', '0299368555', '5145558054',
       '810663425555', '2155559857', '40322555', '9145554562', '31123555',
       '1715550297', '5085559555', '61776555', '1715557555', '932034555',
       '2155554369', '7605558146', '02555467', '6045554555', '6175559555',
       '1985558888', '981443655', '4085553659', '142342555', '76753555',
       '6175552555', '652241555', '6325553587', '91244555', '02215554327',
       '0897034555', '0522556555', '6175557555', '496966902555',
       '35898045555', '2125557413', '35318621555', '34913728555',
       '1715551555', '86213555', '2125551957', '3105552373', '955558282',
       '4155554312', '88601555', '7025551838', '4722121555', '035640555',
       '61938446555', '2035554407', '498961089555', '07123672555',
       '6175558428'], dtype=object)

In [10]:
df.to_csv("../Database/customers.csv", sep=",", encoding='Latin-1', index=False)

## Products

In [11]:
df = pd.read_csv("../Database/products.csv")
df.head()

  PRODUCTCODE   PRODUCTLINE  MSRP
0    S10_1678   Motorcycles    95
1    S10_1949  Classic Cars   214
2    S10_2016   Motorcycles   118
3    S10_4698   Motorcycles   193
4    S10_4757  Classic Cars   136

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109 entries, 0 to 108
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PRODUCTCODE  109 non-null    object
 1   PRODUCTLINE  109 non-null    object
 2   MSRP         109 non-null    int64
dtypes: int64(1), object(2)
memory usage: 2.7+ KB

## Orders

In [13]:
df = pd.read_csv("../Database/orders.csv")
df.head()

,ORDERNUMBER,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,DEALSIZE,customer_id
0,10107,2/24/2003 0:00,Shipped,1,2,2003,Small,1
1,10121,5/7/2003 0:00,Shipped,2,5,2003,Small,2
2,10134,7/1/2003 0:00,Shipped,3,7,2003,Medium,3
3,10145,8/25/2003 0:00,Shipped,3,8,2003,Medium,4
4,10159,10/10/2003 0:00,Shipped,4,10,2003,Medium,5

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 698 entries, 0 to 697
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ORDERNUMBER  698 non-null    int64
 1   ORDERDATE    698 non-null    object
 2   STATUS       698 non-null    object
 3   QTR_ID       698 non-null    int64
 4   MONTH_ID     698 non-null    int64
 5   YEAR_ID      698 non-null    int64
 6   DEALSIZE     698 non-null    object
 7   customer_id  698 non-null    int64
dtypes: int64(5), object(3)
memory usage: 43.8+ KB

In [15]:
df['ORDERDATE'] = pd.to_datetime(df['ORDERDATE'])
df.head(3)

,ORDERNUMBER,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,DEALSIZE,customer_id
0,10107,2003-02-24,Shipped,1,2,2003,Small,1
1,10121,2003-05-07,Shipped,2,5,2003,Small,2
2,10134,2003-07-01,Shipped,3,7,2003,Medium,3

In [16]:
df['STATUS'].value_counts()

STATUS
Shipped       653
In Process     12
On Hold        10
Resolved        9
Cancelled       8
Disputed        6
Name: count, dtype: int64

In [17]:
df.drop(['MONTH_ID', 'YEAR_ID'], axis=1, inplace=True)

In [18]:
df['DEALSIZE'].value_counts()

DEALSIZE
Medium    292
Small     287
Large     119
Name: count, dtype: int64

In [19]:
df.to_csv("../Database/orders.csv", sep=",", encoding='Latin-1', index=False)

## Order Items

In [20]:
df = pd.read_csv("../Database/order_items.csv")
df.head()

,ORDERNUMBER,PRODUCTCODE,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES
0,10107,S10_1678,30,95.70,2,2871.00
1,10121,S10_1678,34,81.35,5,2765.90
2,10134,S10_1678,41,94.74,2,3884.34
3,10145,S10_1678,45,83.26,6,3746.70
4,10159,S10_1678,49,100.00,14,4900.00

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ORDERNUMBER      2823 non-null   int64
 1   PRODUCTCODE      2823 non-null   object
 2   QUANTITYORDERED  2823 non-null   int64
 3   PRICEEACH        2823 non-null   float64
 4   ORDERLINENUMBER  2823 non-null   int64
 5   SALES            2823 non-null   float64
dtypes: float64(2), int64(3), object(1)
memory usage: 132.5+ KB